betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_spi.c
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    hspi->MspInitCallback(hspi);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    DAL_SPI_MspInit(hspi);
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */
  }

  hspi->State = DAL_SPI_STATE_BUSY;

  /* Disable the selected SPI peripheral */
  __DAL_SPI_DISABLE(hspi);

  /*----------------------- SPIx CTRL1 & CTRL2 Configuration ---------------------*/
  /* Configure : SPI Mode, Communication Mode, Data size, Clock polarity and phase, NSS management,
  Communication speed, First bit and CRC calculation state */
  WRITE_REG(hspi->Instance->CTRL1, ((hspi->Init.Mode & (SPI_CTRL1_MSMCFG | SPI_CTRL1_ISSEL)) |
                                  (hspi->Init.Direction & (SPI_CTRL1_RXOMEN | SPI_CTRL1_BMEN)) |
                                  (hspi->Init.DataSize & SPI_CTRL1_DFLSEL) |
                                  (hspi->Init.CLKPolarity & SPI_CTRL1_CPOL) |
                                  (hspi->Init.CLKPhase & SPI_CTRL1_CPHA) |
                                  (hspi->Init.NSS & SPI_CTRL1_SSEN) |
                                  (hspi->Init.BaudRatePrescaler & SPI_CTRL1_BRSEL_Msk) |
                                  (hspi->Init.FirstBit  & SPI_CTRL1_LSBSEL) |
                                  (hspi->Init.CRCCalculation & SPI_CTRL1_CRCEN)));

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Configure : NSS management, TI Mode */
  WRITE_REG(hspi->Instance->CTRL2, (((hspi->Init.NSS >> 16U) & SPI_CTRL2_SSOEN) | (hspi->Init.TIMode & SPI_CTRL2_FRFCFG)));
#else
  /* Configure : NSS management, TI Mode */
  WRITE_REG(hspi->Instance->CTRL2, ((hspi->Init.NSS >> 16U) & SPI_CTRL2_SSOEN));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if (USE_SPI_CRC != 0U)
  /*---------------------------- SPIx CRCPOLY Configuration ------------------*/
  /* Configure : CRC Polynomial */
  if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
  {
    WRITE_REG(hspi->Instance->CRCPOLY, (hspi->Init.CRCPolynomial & SPI_CRCPOLY_CRCPOLY_Msk));
  }
#endif /* USE_SPI_CRC */

#if defined(SPI_I2SCFG_MODESEL)
  /* Activate the SPI mode (Make sure that MODESEL bit in I2SCFG register is reset) */
  CLEAR_BIT(hspi->Instance->I2SCFG, SPI_I2SCFG_MODESEL);
#endif /* SPI_I2SCFG_MODESEL */

  hspi->ErrorCode = DAL_SPI_ERROR_NONE;
  hspi->State     = DAL_SPI_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  De-Initialize the SPI peripheral.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SPI_DeInit(SPI_HandleTypeDef *hspi)
{
  /* Check the SPI handle allocation */
  if (hspi == NULL)
  {
    return DAL_ERROR;
  }

  /* Check SPI Instance parameter */
  ASSERT_PARAM(IS_SPI_ALL_INSTANCE(hspi->Instance));

  hspi->State = DAL_SPI_STATE_BUSY;

  /* Disable the SPI Peripheral Clock */
  __DAL_SPI_DISABLE(hspi);

#if (USE_DAL_SPI_REGISTER_CALLBACKS == 1U)
  if (hspi->MspDeInitCallback == NULL)
  {
    hspi->MspDeInitCallback = DAL_SPI_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  hspi->MspDeInitCallback(hspi);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  DAL_SPI_MspDeInit(hspi);
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */

  hspi->ErrorCode = DAL_SPI_ERROR_NONE;
  hspi->State = DAL_SPI_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(hspi);

  return DAL_OK;
}

/**
  * @brief  Initialize the SPI MSP.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void DAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hspi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SPI_MspInit should be implemented in the user file
   */
}

/**
  * @brief  De-Initialize the SPI MSP.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void DAL_SPI_MspDeInit(SPI_HandleTypeDef *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hspi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SPI_MspDeInit should be implemented in the user file
   */
}

#if (USE_DAL_SPI_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User SPI Callback
  *         To be used instead of the weak predefined callback
  * @param  hspi Pointer to a SPI_HandleTypeDef structure that contains
  *                the configuration information for the specified SPI.
  * @param  CallbackID ID of the callback to be registered
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SPI_RegisterCallback(SPI_HandleTypeDef *hspi, DAL_SPI_CallbackIDTypeDef CallbackID,
                                           pSPI_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hspi->ErrorCode |= DAL_SPI_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hspi);

  if (DAL_SPI_STATE_READY == hspi->State)
  {
    switch (CallbackID)
    {
      case DAL_SPI_TX_COMPLETE_CB_ID :
        hspi->TxCpltCallback = pCallback;
        break;

      case DAL_SPI_RX_COMPLETE_CB_ID :
        hspi->RxCpltCallback = pCallback;
        break;

      case DAL_SPI_TX_RX_COMPLETE_CB_ID :
        hspi->TxRxCpltCallback = pCallback;
        break;

      case DAL_SPI_TX_HALF_COMPLETE_CB_ID :
        hspi->TxHalfCpltCallback = pCallback;
        break;

      case DAL_SPI_RX_HALF_COMPLETE_CB_ID :
        hspi->RxHalfCpltCallback = pCallback;
        break;

