betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_spi.c
      case DAL_SPI_TX_RX_HALF_COMPLETE_CB_ID :
        hspi->TxRxHalfCpltCallback = pCallback;
        break;

      case DAL_SPI_ERROR_CB_ID :
        hspi->ErrorCallback = pCallback;
        break;

      case DAL_SPI_ABORT_CB_ID :
        hspi->AbortCpltCallback = pCallback;
        break;

      case DAL_SPI_MSPINIT_CB_ID :
        hspi->MspInitCallback = pCallback;
        break;

      case DAL_SPI_MSPDEINIT_CB_ID :
        hspi->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_SPI_STATE_RESET == hspi->State)
  {
    switch (CallbackID)
    {
      case DAL_SPI_MSPINIT_CB_ID :
        hspi->MspInitCallback = pCallback;
        break;

      case DAL_SPI_MSPDEINIT_CB_ID :
        hspi->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hspi);
  return status;
}

/**
  * @brief  Unregister an SPI Callback
  *         SPI callback is redirected to the weak predefined callback
  * @param  hspi Pointer to a SPI_HandleTypeDef structure that contains
  *                the configuration information for the specified SPI.
  * @param  CallbackID ID of the callback to be unregistered
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SPI_UnRegisterCallback(SPI_HandleTypeDef *hspi, DAL_SPI_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hspi);

  if (DAL_SPI_STATE_READY == hspi->State)
  {
    switch (CallbackID)
    {
      case DAL_SPI_TX_COMPLETE_CB_ID :
        hspi->TxCpltCallback = DAL_SPI_TxCpltCallback;             /* Legacy weak TxCpltCallback       */
        break;

      case DAL_SPI_RX_COMPLETE_CB_ID :
        hspi->RxCpltCallback = DAL_SPI_RxCpltCallback;             /* Legacy weak RxCpltCallback       */
        break;

      case DAL_SPI_TX_RX_COMPLETE_CB_ID :
        hspi->TxRxCpltCallback = DAL_SPI_TxRxCpltCallback;         /* Legacy weak TxRxCpltCallback     */
        break;

      case DAL_SPI_TX_HALF_COMPLETE_CB_ID :
        hspi->TxHalfCpltCallback = DAL_SPI_TxHalfCpltCallback;     /* Legacy weak TxHalfCpltCallback   */
        break;

      case DAL_SPI_RX_HALF_COMPLETE_CB_ID :
        hspi->RxHalfCpltCallback = DAL_SPI_RxHalfCpltCallback;     /* Legacy weak RxHalfCpltCallback   */
        break;

      case DAL_SPI_TX_RX_HALF_COMPLETE_CB_ID :
        hspi->TxRxHalfCpltCallback = DAL_SPI_TxRxHalfCpltCallback; /* Legacy weak TxRxHalfCpltCallback */
        break;

      case DAL_SPI_ERROR_CB_ID :
        hspi->ErrorCallback = DAL_SPI_ErrorCallback;               /* Legacy weak ErrorCallback        */
        break;

      case DAL_SPI_ABORT_CB_ID :
        hspi->AbortCpltCallback = DAL_SPI_AbortCpltCallback;       /* Legacy weak AbortCpltCallback    */
        break;

      case DAL_SPI_MSPINIT_CB_ID :
        hspi->MspInitCallback = DAL_SPI_MspInit;                   /* Legacy weak MspInit              */
        break;

      case DAL_SPI_MSPDEINIT_CB_ID :
        hspi->MspDeInitCallback = DAL_SPI_MspDeInit;               /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_SPI_STATE_RESET == hspi->State)
  {
    switch (CallbackID)
    {
      case DAL_SPI_MSPINIT_CB_ID :
        hspi->MspInitCallback = DAL_SPI_MspInit;                   /* Legacy weak MspInit              */
        break;

      case DAL_SPI_MSPDEINIT_CB_ID :
        hspi->MspDeInitCallback = DAL_SPI_MspDeInit;               /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hspi);
  return status;
}
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group2 IO operation functions
  *  @brief   Data transfers functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
 ===============================================================================
 [..]
    This subsection provides a set of functions allowing to manage the SPI
    data transfers.

    [..] The SPI supports master and slave mode :

    (#) There are two modes of transfer:
       (++) Blocking mode: The communication is performed in polling mode.
            The DAL status of all data processing is returned by the same function
            after finishing transfer.
       (++) No-Blocking mode: The communication is performed using Interrupts
            or DMA, These APIs return the DAL status.
            The end of the data processing will be indicated through the
            dedicated SPI IRQ when using Interrupt mode or the DMA IRQ when
            using DMA mode.
            The DAL_SPI_TxCpltCallback(), DAL_SPI_RxCpltCallback() and DAL_SPI_TxRxCpltCallback() user callbacks
            will be executed respectively at the end of the transmit or Receive process
            The DAL_SPI_ErrorCallback()user callback will be executed when a communication error is detected

    (#) APIs provided for these 2 transfer modes (Blocking mode or Non blocking mode using either Interrupt or DMA)
        exist for 1Line (simplex) and 2Lines (full duplex) modes.

@endverbatim
  * @{
  */

/**
  * @brief  Transmit an amount of data in blocking mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be sent
  * @param  Timeout Timeout duration
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SPI_Transmit(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
  uint32_t tickstart;
  DAL_StatusTypeDef errorcode = DAL_OK;
  uint16_t initial_TxXferCount;

  /* Check Direction parameter */
  ASSERT_PARAM(IS_SPI_DIRECTION_2LINES_OR_1LINE(hspi->Init.Direction));

  /* Process Locked */
  __DAL_LOCK(hspi);

  /* Init tickstart for timeout management*/
  tickstart = DAL_GetTick();
  initial_TxXferCount = Size;

  if (hspi->State != DAL_SPI_STATE_READY)
  {
    errorcode = DAL_BUSY;
    goto error;
  }

  if ((pData == NULL) || (Size == 0U))
  {
    errorcode = DAL_ERROR;
    goto error;
  }

