betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_spi.c
  /* Clear ERRIEN interrupt to avoid error interrupts generation during Abort procedure */
  CLEAR_BIT(hspi->Instance->CTRL2, SPI_CTRL2_ERRIEN);

  /* Disable TXBEIEN, RXBNEIEN and ERRIEN(mode fault event, overrun error, TI frame error) interrupts */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_TXBEIEN))
  {
    hspi->TxISR = SPI_AbortTx_ISR;
    /* Wait DAL_SPI_STATE_ABORT state */
    do
    {
      if (count == 0U)
      {
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
        break;
      }
      count--;
    } while (hspi->State != DAL_SPI_STATE_ABORT);
    /* Reset Timeout Counter */
    count = resetcount;
  }

  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_RXBNEIEN))
  {
    hspi->RxISR = SPI_AbortRx_ISR;
    /* Wait DAL_SPI_STATE_ABORT state */
    do
    {
      if (count == 0U)
      {
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
        break;
      }
      count--;
    } while (hspi->State != DAL_SPI_STATE_ABORT);
    /* Reset Timeout Counter */
    count = resetcount;
  }

  /* Disable the SPI DMA Tx request if enabled */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_TXDEN))
  {
    /* Abort the SPI DMA Tx Stream/Channel : use blocking DMA Abort API (no callback) */
    if (hspi->hdmatx != NULL)
    {
      /* Set the SPI DMA Abort callback :
      will lead to call DAL_SPI_AbortCpltCallback() at end of DMA abort procedure */
      hspi->hdmatx->XferAbortCallback = NULL;

      /* Abort DMA Tx Handle linked to SPI Peripheral */
      if (DAL_DMA_Abort(hspi->hdmatx) != DAL_OK)
      {
        hspi->ErrorCode = DAL_SPI_ERROR_ABORT;
      }

      /* Disable Tx DMA Request */
      CLEAR_BIT(hspi->Instance->CTRL2, (SPI_CTRL2_TXDEN));

      /* Wait until TXE flag is set */
      do
      {
        if (count == 0U)
        {
          SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
          break;
        }
        count--;
      } while ((hspi->Instance->STS & SPI_FLAG_TXE) == RESET);
    }
  }

  /* Disable the SPI DMA Rx request if enabled */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_RXDEN))
  {
    /* Abort the SPI DMA Rx Stream/Channel : use blocking DMA Abort API (no callback) */
    if (hspi->hdmarx != NULL)
    {
      /* Set the SPI DMA Abort callback :
      will lead to call DAL_SPI_AbortCpltCallback() at end of DMA abort procedure */
      hspi->hdmarx->XferAbortCallback = NULL;

      /* Abort DMA Rx Handle linked to SPI Peripheral */
      if (DAL_DMA_Abort(hspi->hdmarx) != DAL_OK)
      {
        hspi->ErrorCode = DAL_SPI_ERROR_ABORT;
      }

      /* Disable peripheral */
      __DAL_SPI_DISABLE(hspi);

      /* Disable Rx DMA Request */
      CLEAR_BIT(hspi->Instance->CTRL2, (SPI_CTRL2_RXDEN));
    }
  }
  /* Reset Tx and Rx transfer counters */
  hspi->RxXferCount = 0U;
  hspi->TxXferCount = 0U;

  /* Check error during Abort procedure */
  if (hspi->ErrorCode == DAL_SPI_ERROR_ABORT)
  {
    /* return DAL_Error in case of error during Abort procedure */
    errorcode = DAL_ERROR;
  }
  else
  {
    /* Reset errorCode */
    hspi->ErrorCode = DAL_SPI_ERROR_NONE;
  }

  /* Clear the Error flags in the SR register */
  __DAL_SPI_CLEAR_OVRFLAG(hspi);

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  __DAL_SPI_CLEAR_FREFLAG(hspi);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Restore hspi->state to ready */
  hspi->State = DAL_SPI_STATE_READY;

  return errorcode;
}

/**
  * @brief  Abort ongoing transfer (Interrupt mode).
  * @param  hspi SPI handle.
  * @note   This procedure could be used for aborting any ongoing transfer (Tx and Rx),
  *         started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable SPI Interrupts (depending of transfer direction)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling DAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SPI_Abort_IT(SPI_HandleTypeDef *hspi)
{
  DAL_StatusTypeDef errorcode;
  uint32_t abortcplt ;
  __IO uint32_t count;
  __IO uint32_t resetcount;

  /* Initialized local variable  */
  errorcode = DAL_OK;
  abortcplt = 1U;
  resetcount = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);
  count = resetcount;

  /* Clear ERRIE interrupt to avoid error interrupts generation during Abort procedure */
  CLEAR_BIT(hspi->Instance->CTRL2, SPI_CTRL2_ERRIEN);

  /* Change Rx and Tx Irq Handler to Disable TXEIE, RXNEIE and ERRIE interrupts */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_TXBEIEN))
  {
    hspi->TxISR = SPI_AbortTx_ISR;
    /* Wait DAL_SPI_STATE_ABORT state */
    do
    {
      if (count == 0U)
      {
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
        break;
      }
      count--;
    } while (hspi->State != DAL_SPI_STATE_ABORT);
    /* Reset Timeout Counter */
    count = resetcount;
  }

  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_RXBNEIEN))
  {
    hspi->RxISR = SPI_AbortRx_ISR;
    /* Wait DAL_SPI_STATE_ABORT state */
    do
    {
      if (count == 0U)
      {
        SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
        break;
      }
      count--;
    } while (hspi->State != DAL_SPI_STATE_ABORT);
    /* Reset Timeout Counter */
    count = resetcount;
  }

  /* If DMA Tx and/or DMA Rx Handles are associated to SPI Handle, DMA Abort complete callbacks should be initialised
     before any call to DMA Abort functions */
  /* DMA Tx Handle is valid */
  if (hspi->hdmatx != NULL)
  {
    /* Set DMA Abort Complete callback if UART DMA Tx request if enabled.
       Otherwise, set it to NULL */
    if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_TXDEN))
    {
      hspi->hdmatx->XferAbortCallback = SPI_DMATxAbortCallback;
    }
    else
    {
      hspi->hdmatx->XferAbortCallback = NULL;
    }
  }
  /* DMA Rx Handle is valid */
  if (hspi->hdmarx != NULL)
  {
    /* Set DMA Abort Complete callback if UART DMA Rx request if enabled.
       Otherwise, set it to NULL */
    if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_RXDEN))
    {
      hspi->hdmarx->XferAbortCallback = SPI_DMARxAbortCallback;
    }
    else
    {
      hspi->hdmarx->XferAbortCallback = NULL;
    }
  }

  /* Disable the SPI DMA Tx request if enabled */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_TXDEN))
  {
    /* Abort the SPI DMA Tx Stream/Channel */
    if (hspi->hdmatx != NULL)
    {
      /* Abort DMA Tx Handle linked to SPI Peripheral */
      if (DAL_DMA_Abort_IT(hspi->hdmatx) != DAL_OK)
      {
        hspi->hdmatx->XferAbortCallback = NULL;
        hspi->ErrorCode = DAL_SPI_ERROR_ABORT;
      }
      else
      {
        abortcplt = 0U;
      }
    }
  }
  /* Disable the SPI DMA Rx request if enabled */
  if (DAL_IS_BIT_SET(hspi->Instance->CTRL2, SPI_CTRL2_RXDEN))
  {
    /* Abort the SPI DMA Rx Stream/Channel */
    if (hspi->hdmarx != NULL)
    {
      /* Abort DMA Rx Handle linked to SPI Peripheral */
      if (DAL_DMA_Abort_IT(hspi->hdmarx) !=  DAL_OK)
      {
        hspi->hdmarx->XferAbortCallback = NULL;
        hspi->ErrorCode = DAL_SPI_ERROR_ABORT;
      }
      else
      {
        abortcplt = 0U;
      }
    }
  }

  if (abortcplt == 1U)
  {
    /* Reset Tx and Rx transfer counters */
    hspi->RxXferCount = 0U;
    hspi->TxXferCount = 0U;

    /* Check error during Abort procedure */
    if (hspi->ErrorCode == DAL_SPI_ERROR_ABORT)
    {
      /* return DAL_Error in case of error during Abort procedure */
      errorcode = DAL_ERROR;
    }
    else
    {
      /* Reset errorCode */
      hspi->ErrorCode = DAL_SPI_ERROR_NONE;
    }

