betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_spi.c
  /* Disable TXE and ERR interrupt */
  __DAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_ERR));

  /* Check the end of the transaction */
  if (SPI_EndRxTxTransaction(hspi, SPI_DEFAULT_TIMEOUT, tickstart) != DAL_OK)
  {
    SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_FLAG);
  }

  /* Clear overrun flag in 2 Lines communication mode because received is not read */
  if (hspi->Init.Direction == SPI_DIRECTION_2LINES)
  {
    __DAL_SPI_CLEAR_OVRFLAG(hspi);
  }

  hspi->State = DAL_SPI_STATE_READY;
  if (hspi->ErrorCode != DAL_SPI_ERROR_NONE)
  {
    /* Call user error callback */
#if (USE_DAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->ErrorCallback(hspi);
#else
    DAL_SPI_ErrorCallback(hspi);
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */
  }
  else
  {
    /* Call user Rx complete callback */
#if (USE_DAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->TxCpltCallback(hspi);
#else
    DAL_SPI_TxCpltCallback(hspi);
#endif /* USE_DAL_SPI_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Handle abort a Rx transaction.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_AbortRx_ISR(SPI_HandleTypeDef *hspi)
{
  __IO uint32_t tmpreg = 0U;
  __IO uint32_t count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);

  /* Wait until TXE flag is set */
  do
  {
    if (count == 0U)
    {
      SET_BIT(hspi->ErrorCode, DAL_SPI_ERROR_ABORT);
      break;
    }
    count--;
  } while ((hspi->Instance->STS & SPI_FLAG_TXE) == RESET);

  /* Disable SPI Peripheral */
  __DAL_SPI_DISABLE(hspi);

  /* Disable TXBEIEN, RXBNEIEN and ERRIEN(mode fault event, overrun error, TI frame error) interrupts */
  CLEAR_BIT(hspi->Instance->CTRL2, (SPI_CTRL2_TXBEIEN | SPI_CTRL2_RXBNEIEN | SPI_CTRL2_ERRIEN));

  /* Flush Data Register by a blank read */
  tmpreg = READ_REG(hspi->Instance->DATA);
  /* To avoid GCC warning */
  UNUSED(tmpreg);

  hspi->State = DAL_SPI_STATE_ABORT;
}

/**
  * @brief  Handle abort a Tx or Rx/Tx transaction.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_AbortTx_ISR(SPI_HandleTypeDef *hspi)
{
  /* Disable TXBEIEN interrupt */
  CLEAR_BIT(hspi->Instance->CTRL2, (SPI_CTRL2_TXBEIEN));

  /* Disable SPI Peripheral */
  __DAL_SPI_DISABLE(hspi);

  hspi->State = DAL_SPI_STATE_ABORT;
}

/**
  * @}
  */

#endif /* DAL_SPI_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

